---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasec
source: html/728dcccd-43f7-fb32-e244-5712e78279aa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasec Property

"Branch Circuit Current Phase C"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasec { get; }
```